[
    {
      "id": "1",
      "title": "Psycho",
      "description": "A Phoenix secretary embezzles $40,000 from her employer's client, goes on the run, and checks into a remote motel run by a young man under the domination of his mother.",
      "price": 9.99,
      "stock": 100,
      "code": "PSY-123"
    },
    {
      "id": "2",
      "title": "The Birds",
      "description": "A wealthy San Francisco socialite pursues a potential boyfriend to a small Northern California town that slowly takes a turn for the bizarre when birds of all kinds suddenly begin to attack people.",
      "price": 12.99,
      "stock": 50,
      "code": "BIR-456"
    },
    {
      "id": "3",
      "title": "Rear Window",
      "description": "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.",
      "price": 14.99,
      "stock": 75,
      "code": "REA-789"
    },
    {
      "id": "4",
      "title": "Vertigo",
      "description": "A former police detective juggles wrestling with his personal demons and becoming obsessed with a hauntingly beautiful woman.",
      "price": 19.99,
      "stock": 25,
      "code": "VER-012"
    },
    {
      "id": "5",
      "title": "North by Northwest",
      "description": "A New York City advertising executive goes on the run after being mistaken for a government agent by a group of foreign spies.",
      "price": 15.99,
      "stock": 60,
      "code": "NBN-345"
    },
    {
      "id": "6",
      "title": "Dial M for Murder",
      "description": "A tennis player frames his unfaithful wife for first-degree murder after she inadvertently hinders his plan to kill her.",
      "price": 11.99,
      "stock": 80,
      "code": "DIA-678"
    },
    {
      "id": "7",
      "title": "To Catch a Thief",
      "description": "A retired jewel thief sets out to prove his innocence after being suspected of returning to his former occupation.",
      "price": 13.99,
      "stock": 70,
      "code": "TCA-901"
    },
    {
      "id": "8",
      "title": "Marnie",
      "description": "A troubled woman is plagued by a series of personal conflicts which ultimately leads to a dramatic confrontation with her boss.",
      "price": 17.99,
      "stock": 30,
      "code": "MAR-234"
    },
    {
      "id": "9",
      "title": "The Trouble with Harry",
      "description": "The trouble with Harry is that he's dead, and everyone seems to have a different idea of what should be done with his body.",
      "price": 8.99,
      "stock": 100,
      "code": "THW-567"
    },
    {
      "id": "10",
      "title": "Frenzy",
      "description": "A serial killer is murdering women with a necktie, and a London ex-convict who was just released from prison becomes the prime suspect in the killings.",
      "price": 10.99,
      "stock": 90,
      "code": "FRE-890"
    }
  ]