[{"title":"Psycho","price":7,"stock":10,"status":true,"description":"Psycho is a 1960 American psychological horror film directed by Alfred Hitchcock. The film centers on an encounter between a secretary, Marion Crane, who ends up at a remote motel after stealing money from her employer, and the motel's disturbed owner-manager, Norman Bates.","thumbnail":"rutaImagen","code":1},{"title":"Vertigo","price":22,"stock":8,"status":true,"description":"Vertigo is a 1958 American psychological thriller film directed and produced by Alfred Hitchcock. The film follows John 'Scottie' Ferguson, a former police detective who suffers from acrophobia, as he is hired by an acquaintance to follow his wife, Madeleine Elster, who is behaving strangely.","thumbnail":"rutaImagen","code":2},{"title":"Rear Window","price":15,"stock":12,"status":true,"description":"Rear Window is a 1954 American Technicolor mystery thriller film directed by Alfred Hitchcock and written by John Michael Hayes. The film stars James Stewart as L.B. 'Jeff' Jefferies, a photojournalist who becomes convinced one of his neighbors has committed murder and involves his glamorous socialite girlfriend, Lisa Carol Fremont (Grace Kelly), and his nurse Stella (Thelma Ritter) in helping him investigate the crime.","thumbnail":"rutaImagen","code":3},{"title":"The Birds","price":25,"stock":9,"status":true,"description":"The Birds is a 1963 American horror-thriller film directed and produced by Alfred Hitchcock, loosely based on the 1952 story 'The Birds' by Daphne du Maurier. It focuses on a series of sudden and unexplained bird attacks on the people of Bodega Bay, California, over the course of a few days.","thumbnail":"rutaImagen","code":4},{"title":"Dial M for Murder","price":20,"stock":15,"status":true,"description":"Dial M for Murder is a 1954 American thriller film directed by Alfred Hitchcock, starring Ray Milland, Grace Kelly, and Robert Cummings. The film is based on the play of the same name by Frederick Knott.","thumbnail":"rutaImagen","code":5},{"title":"To Catch a Thief","price":10,"stock":12,"status":true,"description":"To Catch a Thief is a 1955 American romantic thriller film directed by Alfred Hitchcock and starring Cary Grant and Grace Kelly. The film is set in the French Riviera and follows a retired cat burglar who must save his reputation by catching a copycat thief who is targeting wealthy tourists.","thumbnail":"rutaImagen","code":6},{"title":"The Man Who Knew Too Much","price":12,"stock":20,"status":true,"description":"The Man Who Knew Too Much is a 1956 American suspense film directed by Alfred Hitchcock, starring James Stewart and Doris Day. The film is a remake of Hitchcock's own 1934 film of the same name.","thumbnail":"rutaImagen","code":7},{"title":"Marnie","description":"Marnie is a 1964 American psychological thriller film directed by Alfred Hitchcock, and starring Tippi Hedren and Sean Connery.","code":"8","status":true,"stock":100,"thumbnail":"rutaImagen","price":19.99},{"title":"Torn Curtain","description":"Torn Curtain is a 1966 American spy film directed by Alfred Hitchcock, and starring Paul Newman and Julie Andrews.","code":"9","status":true,"stock":100,"thumbnail":"rutaImagen","price":16.99},{"id":201,"title":"Otra pelicula3","description":"Marnie is a 1964 American psychological thriller film directed by Alfred Hitchcock, and starring Tippi Hedren and Sean Connery.","code":"8","status":true,"stock":100,"thumbnail":"rutaImagen","price":19.99},{"id":25,"title":"Otra pelicula5","description":"Marnie is a 1964 American psychological thriller film directed by Alfred Hitchcock, and starring Tippi Hedren and Sean Connery.","code":"8","status":true,"stock":100,"thumbnail":"rutaImagen","price":19.99}]